# About this project

This project aims to demonstrate the use of SQL to answer hypothetical sales and marketing questions about a DVD rental store with a MySQL database named Sakila.

# Sakila Database

The Sakila database is a nicely normalised schema modelling a DVD rental store, featuring things like films, actors, film-actor relationships, and a central inventory table that connects films, stores, and rentals.

The Sakila MySQL sample database is available from http://dev.mysql.com/doc/index-other.html. 


## Sakila Database Entity Relationship Diagram(ERD)

<img src="https://www.jooq.org/img/sakila.png">


## Problem Description
   
    
- **Inventory summary**:
    - What's the total value of all the inventory and total inventory value of each store?
    - How many film are there in each category of each store, and the total inventory count?
    - How many films are there in each rating?
    - How's the film inventory level looks like?
    - Which actor/actress is in the most films in store inventory?

        
- **Consumer behavior**:
    - How many days do customer usually rent?
    - Do customer usually rent on weekdays or weekends?
    - What are the top films that customers rented for the longest days accumulatively, and rented for the most times?
    - Among the films that rented most frequently, are they usually rented on weekday or weekends?
    - What is the average rental period?
    - Which genres are most popular? 
    - Who are identified as loyalty customers?
    - Were there customers who did not return the film?
    - Which actors/actresses are most popular given our rental history?
    

- **Store performance**:
    - How many stores are there and how many staff in each store?
    - What's the number of transaction each month for both store?
    - Which store has more customer rented the film?
    - Which store makes the most money? 
  
  
- **Sales summary**:
    - What's the total revenue for the time period and for each month?
    - What's the most profitable move genres/rating?
    - Do we make the most money from long or short rentals?

In [1]:
#pip install ipython-sql #SQL magic function

In [2]:
# pip install pymysql

In [1]:
# Loading the SQL module
%load_ext sql

In [2]:
# Connect to database
%sql mysql+pymysql://root:123456@localhost/sakila

# Inventory summary

### What's the total value of all the inventory and total inventory value of each store?

In [46]:
%%sql

select distinct i.store_id,
       sum(f.replacement_cost) over (partition by i.store_id) store_total_value,
       sum(f.replacement_cost) over () total_value
from inventory i
left join film f
on i.film_id = f.film_id

 * mysql+pymysql://root:***@localhost/sakila
2 rows affected.

[(1, Decimal('46205.30'), Decimal('92621.19')),
 (2, Decimal('46415.89'), Decimal('92621.19'))]

### How many film are there in each category of each store, and the total inventory count?

In [55]:
%%sql

select distinct c.name category_name, 
       count(i.film_id) over (partition by c.name) category_inventory_count,
       count(i.film_id) over () total_inventory_count
from inventory i
left join film_category fc
on i.film_id = fc.film_id
left join category c
on c.category_id = fc.category_id
order by category_inventory_count desc
limit 5

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('Sports', 344, 4581),
 ('Animation', 335, 4581),
 ('Action', 312, 4581),
 ('Sci-Fi', 312, 4581),
 ('Family', 310, 4581)]

### How many films are there in each rating?

In [7]:
%%sql

select distinct f.rating, 
       count(i.inventory_id) over (partition by f.rating) num_of_film
from inventory i
left join film f
on i.film_id = f.film_id

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('G', 791), ('PG', 924), ('PG-13', 1018), ('R', 904), ('NC-17', 944)]

### How's the film inventory level looks like?

- For films count < 2, low inventory
- For films count >= 2 and count < =5, medium inventory
- For films count >5, hight inventory

In [40]:
%%sql

with level as (select f.film_id, 
       case 
       when count(i.inventory_id)<2 then 'Low'
       when count(i.inventory_id)>5 then 'High'
       else 'Medium' end as inventory_level
from film f
left join inventory i
on f.film_id = i.film_id
group by f.film_id
order by inventory_level, i.film_id)

select inventory_level, count(inventory_level) num_of_film
from level
group by inventory_level

 * mysql+pymysql://root:***@localhost/sakila
3 rows affected.

[('High', 375), ('Low', 42), ('Medium', 583)]

### Which actor/actress is in the most films in store inventory?

In [56]:
%%sql

select distinct concat(a.first_name, ' ', a.last_name) actor_name, 
       count(i.inventory_id) over (partition by fa.actor_id) num_of_film_played
from inventory i
left join film_actor fa
on i.film_id = fa.film_id
left join actor a
on fa.actor_id = a.actor_id
order by num_of_film_played desc
limit 5

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('GINA DEGENERES', 214),
 ('MATTHEW CARREY', 198),
 ('MARY KEITEL', 192),
 ('WALTER TORN', 186),
 ('ANGELA WITHERSPOON', 184)]

# Consumer behavior

### What is the average rental period?

In [16]:
%%sql

select round(avg(datediff(return_date, rental_date)),0) avg_rental_days
from rental

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(Decimal('5'),)]

### How many days do customer usually rent?

In [57]:
%%sql 

select distinct datediff(return_date, rental_date) rental_days,
       count(datediff(return_date, rental_date)) over(partition by datediff(return_date, rental_date)) num_of_rental
from rental
order by num_of_rental desc
limit 5

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[(7, 1821), (2, 1795), (6, 1783), (8, 1762), (5, 1761)]

### Do customers usually rent on which day of the week?

1=Sunday, 2=Monday, 3=Tuesday, 4=Wednesday, 5=Thursday, 6=Friday, 7=Saturday.

In [61]:
%%sql

select case 
       when dayofweek(rental_date) = 1 then 'sunday'
       when dayofweek(rental_date) = 2 then 'monday'
       when dayofweek(rental_date) = 3 then 'tuesday'
       when dayofweek(rental_date) = 4 then 'wednesday'
       when dayofweek(rental_date) = 5 then 'thursday'
       when dayofweek(rental_date) = 6 then 'friday'
       when dayofweek(rental_date) = 7 then 'saturday'
       end as rental_day,
       count(rental_id) num_of_rental
from rental
group by rental_day
order by num_of_rental desc

 * mysql+pymysql://root:***@localhost/sakila
7 rows affected.

[('tuesday', 2463),
 ('sunday', 2320),
 ('saturday', 2311),
 ('friday', 2272),
 ('monday', 2247),
 ('wednesday', 2231),
 ('thursday', 2200)]

### What are the top films that customers rented for the longest days accumulatively, and rented for the most times?

In [152]:
%%sql

select distinct f.title, 
       sum(datediff(return_date, rental_date)) over(partition by f.title) rental_days,
       count(f.film_id) over(partition by f.title) num_of_rental
from rental r
left join inventory i
on r.inventory_id = i.inventory_id
left join film f
on i.film_id = f.film_id
order by num_of_rental desc
limit 10

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[('BUCKET BROTHERHOOD', Decimal('169'), 34),
 ('ROCKETEER MOTHER', Decimal('177'), 33),
 ('FORWARD TEMPLE', Decimal('180'), 32),
 ('GRIT CLOCKWORK', Decimal('169'), 32),
 ('JUGGLER HARDLY', Decimal('172'), 32),
 ('RIDGEMONT SUBMARINE', Decimal('186'), 32),
 ('SCALAWAG DUCK', Decimal('130'), 32),
 ('APACHE DIVINE', Decimal('128'), 31),
 ('GOODFELLAS SALUTE', Decimal('163'), 31),
 ('HOBBIT ALIEN', Decimal('178'), 31)]

### Among the films that rented most frequently, are they usually rented on weekday or weekends?

In [31]:
%%sql

with rental_day_count as (select i.film_id,
       case when dayofweek(rental_date) in (2,3,4,5,6) then count(r.inventory_id) end as weekday_count,
       case when dayofweek(rental_date) in (1,7) then count(r.inventory_id) end as weekend_count
from rental r
left join inventory i
on i.inventory_id = r.inventory_id
group by r.inventory_id, rental_date, i.film_id)

select title, 
       sum(weekday_count) weekday_rental_count, 
       sum(weekend_count) weekend_rental_count,
       sum(weekday_count)+sum(weekend_count) num_of_rental
from rental_day_count r
left join film f
on f.film_id = r.film_id
group by title
order by num_of_rental desc
limit 10

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[('BUCKET BROTHERHOOD', Decimal('29'), Decimal('5'), Decimal('34')),
 ('ROCKETEER MOTHER', Decimal('30'), Decimal('3'), Decimal('33')),
 ('RIDGEMONT SUBMARINE', Decimal('21'), Decimal('11'), Decimal('32')),
 ('JUGGLER HARDLY', Decimal('22'), Decimal('10'), Decimal('32')),
 ('SCALAWAG DUCK', Decimal('23'), Decimal('9'), Decimal('32')),
 ('FORWARD TEMPLE', Decimal('22'), Decimal('10'), Decimal('32')),
 ('GRIT CLOCKWORK', Decimal('27'), Decimal('5'), Decimal('32')),
 ('WIFE TURN', Decimal('22'), Decimal('9'), Decimal('31')),
 ('ROBBERS JOON', Decimal('25'), Decimal('6'), Decimal('31')),
 ('APACHE DIVINE', Decimal('23'), Decimal('8'), Decimal('31'))]

### Which genres are most popular?

In [58]:
%%sql

select c.name, 
       count(r.inventory_id) times_rented
from rental r
left join inventory i
on r.inventory_id = i.inventory_id
left join film f
on i.film_id = f.film_id
left join film_category fc
on f.film_id = fc.film_id
left join category c
on fc.category_id = c.category_id
group by c.name
order by count(r.inventory_id) desc
limit 5

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('Sports', 1179),
 ('Animation', 1166),
 ('Action', 1112),
 ('Sci-Fi', 1101),
 ('Family', 1096)]

### Who are identified as loyalty customers?

In [18]:
%%sql

select concat(first_name, ' ', last_name) name, 
       sum(amount) total_payment, 
       count(rental_id) times_rented, 
       round(sum(amount)/count(rental_id),2) average_spend
from customer c
left join payment p
on c.customer_id = p.customer_id
group by name
order by sum(amount) desc, count(rental_id) desc
limit 10

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[('KARL SEAL', Decimal('221.55'), 45, Decimal('4.92')),
 ('ELEANOR HUNT', Decimal('216.54'), 46, Decimal('4.71')),
 ('CLARA SHAW', Decimal('195.58'), 42, Decimal('4.66')),
 ('RHONDA KENNEDY', Decimal('194.61'), 39, Decimal('4.99')),
 ('MARION SNYDER', Decimal('194.61'), 39, Decimal('4.99')),
 ('TOMMY COLLAZO', Decimal('186.62'), 38, Decimal('4.91')),
 ('WESLEY BULL', Decimal('177.60'), 40, Decimal('4.44')),
 ('TIM CARY', Decimal('175.61'), 39, Decimal('4.50')),
 ('MARCIA DEAN', Decimal('175.58'), 42, Decimal('4.18')),
 ('ANA BRADLEY', Decimal('174.66'), 34, Decimal('5.14'))]

### Were there customers who did not return the film?

In [54]:
%%sql 

select concat(c.first_name, ' ', c.last_name) customer_name
from rental r
left join customer c
on c.customer_id = r.customer_id
where return_date is null
limit 5

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('GAIL KNIGHT',),
 ('GREGORY MAULDIN',),
 ('LOUISE JENKINS',),
 ('WILLIE HOWELL',),
 ('EMILY DIAZ',)]

### Which actors/actresses are most popular given our rental history?

In [19]:
%%sql

select concat(first_name, ' ', last_name) name, count(r.inventory_id) num_of_rentals
from actor a
left join film_actor fa
on a.actor_id = fa.actor_id
right join inventory i 
on i.film_id = fa.film_id
right join rental r
on r.inventory_id = i.inventory_id
group by 1
order by count(r.rental_id) desc
limit 10

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[('SUSAN DAVIS', 825),
 ('GINA DEGENERES', 753),
 ('MATTHEW CARREY', 678),
 ('MARY KEITEL', 674),
 ('ANGELA WITHERSPOON', 654),
 ('WALTER TORN', 640),
 ('HENRY BERRY', 612),
 ('JAYNE NOLTE', 611),
 ('VAL BOLGER', 605),
 ('SANDRA KILMER', 604)]

# Store Performance

### How many stores are there, and how many staff in each store?

In [21]:
%%sql

select store_id, staff_id
from staff

 * mysql+pymysql://root:***@localhost/sakila
2 rows affected.

[(1, 1), (2, 2)]

### What's the number of transaction each month for both store?

In [22]:
%%sql

select distinct s.store_id,
       substr(p.payment_date, 1, 7) date,
       count(payment_id) over (partition by s.store_id, substr(p.payment_date, 1, 7)) num_of_transaction,
       count(payment_id) over (partition by s.store_id) store_total_transaction
from payment p
left join staff s
on s.staff_id = p.staff_id

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[(1, '2005-08', 2835, 8054),
 (1, '2006-02', 95, 8054),
 (1, '2005-05', 617, 8054),
 (1, '2005-06', 1163, 8054),
 (1, '2005-07', 3344, 8054),
 (2, '2005-07', 3365, 7990),
 (2, '2005-08', 2851, 7990),
 (2, '2006-02', 87, 7990),
 (2, '2005-05', 539, 7990),
 (2, '2005-06', 1148, 7990)]

###  What is store has more customer rented the film?

In [23]:
%%sql

select i.store_id, 
       count(distinct r.rental_id) num_of_rentals
from rental r
left join inventory i
on r.inventory_id = i.inventory_id
group by i.store_id
order by count(distinct r.rental_id)

 * mysql+pymysql://root:***@localhost/sakila
2 rows affected.

[(1, 7923), (2, 8121)]

### Which store makes the most money?

In [24]:
%%sql

select s.store_id, sum(p.amount) sale
from payment p
left join staff s
on s.staff_id = p.staff_id
group by s.store_id
order by sum(p.amount)

 * mysql+pymysql://root:***@localhost/sakila
2 rows affected.

[(1, Decimal('33482.50')), (2, Decimal('33924.06'))]

## Sales

### What's the total revenue for the time period and for each month?

In [162]:
%%sql

select distinct substr(payment_date, 1, 7) month, 
       round(sum(amount) over (partition by substr(payment_date, 1, 7)),0) sales,
       round(sum(amount) over (),0) total_sales
from payment

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('2005-05', Decimal('4823'), Decimal('67407')),
 ('2005-06', Decimal('9630'), Decimal('67407')),
 ('2005-07', Decimal('28369'), Decimal('67407')),
 ('2005-08', Decimal('24070'), Decimal('67407')),
 ('2006-02', Decimal('514'), Decimal('67407'))]

### What's the most profitable move genres/rating?

In [172]:
%%sql

select f.rating, 
       round(sum(p.amount),0) sales
from payment p
left join rental r
on r.rental_id = p.rental_id
left join inventory i
on i.inventory_id = r.inventory_id
left join film f
on i.film_id = f.film_id
group by f.rating
order by sales desc

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('PG-13', Decimal('15259')),
 ('NC-17', Decimal('13875')),
 ('PG', Decimal('13338')),
 ('R', Decimal('13270')),
 ('G', Decimal('11664'))]

In [44]:
%%sql

select c.name category,
       round(sum(p.amount),0) sales
from payment p
left join rental r
on r.rental_id = p.rental_id
left join inventory i
on i.inventory_id = r.inventory_id
left join film_category fc
on i.film_id = fc.film_id
left join category c
on c.category_id = fc.category_id
group by c.name
order by sales desc
limit 5

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('Sports', Decimal('5314')),
 ('Sci-Fi', Decimal('4757')),
 ('Animation', Decimal('4656')),
 ('Drama', Decimal('4587')),
 ('Comedy', Decimal('4384'))]

### Do the stores make more money on long term rental or short term rental?

- Long term rental: >5 days
- Short term rental: <= 5 days

In [30]:
%%sql 

select 
       round(sum(case when datediff(return_date, rental_date) > 5 then amount end),0) as long_term_rental,
       round(sum(case when datediff(return_date, rental_date) <= 5 then amount end),0) as short_term_rental
from payment p
left join rental r
on p.rental_id = r.rental_id

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(Decimal('39780'), Decimal('27108'))]